[
{
    "id": 1,
    "name": "Samsung Galaxy S20 Dual Sim 128GB",
    "title": "Samsung Galaxy S20 (SM-G980F/DS) Dual SIM 128GB, Factory Unlocked GSM, International Version",
    "price": 855.00,
    "rating": 4,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71IX75joWjL._AC_SX522_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewerName": "Stew Ray",
        "ReviewerRating": 4,
        "ReviewTitle": "Most Unreal Phone ive ever had!",
        "postedDate": "September 22, 2020",
        "ReviewDesc": "This phone is not a phone its a computer in yer pocket. its so great! I am not a phone guy, and bought because my daughter, and friends, co workers, etc said its hard impossible to get a hold of me. My old phone was so slow. This has it all, definate buy. I even checked a youtube video on side by side comparison of Xynos and Snapdragon phone and they are basically the same. I keep finding new features with this thing. The super fast charging is epic. I dont know where to start, but this is a definite MUST BUY if you need a phone. I hope there is some left."
    },
    {
        "ReviewerName": "Keifer W.",
        "ReviewerRating": 2,
        "ReviewTitle": "Didn't work",
        "postedDate": "September 5, 2020",
        "ReviewDesc": "It loaded up, took all my info from google, and then turned off and never turned back on. Tried everything, left it on the charger for a couple hours, it doesn’t charge. Tried hard reset, nothing. Junk, don’t buy!"
    },
    {
        "ReviewerName": "Victor Reyes",
        "ReviewerRating": 5,
        "ReviewTitle": "High end at a good price! The best Android on the market",
        "postedDate": "August 28, 2020",
        "ReviewDesc": "Excellent cell phone, it has everything and at a very good price on Amazon, arrived earlier than established."
    },
    {
        "ReviewerName": "Kassandra Wood",
        "ReviewerRating": 5,
        "ReviewTitle": "Love this phone",
        "postedDate": "August 20, 2020",
        "ReviewDesc": "I LOVE this phone ❤ battery life awesome, pictures turn out great, and its so pretty lol. I am so happy with this phone, definitely worth the money."
    }]
},
{
    "id": 2,
    "name": "USB C Hub 14 in 1",
    "title": "USB C Hub 14in1 MacBook Pro Adapter 4K HDMI/VGA/ RJ45 Gigabit Ethernet/ 3.5mm Audio/ 100W PD/USB C Data Port/ 6 USB Ports/SD/TF Card Reader for MacBook/Pro/Air/ChromeBook/Samsung Galaxy and More",
    "price": 56.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/61XSU6Mo2AL._AC_SX679_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Great all in one solution for all the usb devices you have!",
        "ReviewerName": "Jack Simon Hew",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on December 21, 2019",
        "ReviewDesc": "I just got my 16 in MacBook Pro and I was really excited about it. But over a few weeks of daily driving my Mac, I found out that I have a big problem with the different dongles I have that I had to carry around me all the time, I have a few USB c to normal USB adapters in my backpack all the time just to have the ability to use my flash drive and portable hdds. Not only is it hard to carry around but it is also very ugly having 3 different adapters plugged in at once! This adapter has all different types of adapters built into it that only uses one USB c port! Plus you can plug in a power cord and charge using the same adapter! It has 3 USB 3.0 ports 4 USB 2 ports, a 4K HDMI out, USB c power in, an sd card reader and to me personally the vga port is very useful when presenting a slideshow I can plug it in to the projector in our office. What surprises me the most is that you can charge and transfer files from USB stick to MacBook simultaneously while still have fast transfer speed. I occasionally transfer photos from an sd card to my computer, and this solved the problem perfectly! I was able to transfer photos and documents quickly and at full speed! Highly recommended to every MacBook owner, just make sure your device supports this!"
    },
    {
        "ReviewTitle": "Great price! 14in1. Durable. Two USB-C ports!",
        "ReviewerName": "PN",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 4, 2020",
        "ReviewDesc": "I bought a couple of USB-C hubs in the past which have worked really well. The specific ones were from the brand ICZI and I think Choetech. I needed another one that I could just keep in my bag so that I did not have to unplug everything at home all the time from the ones I have at my desk and my wife’s desk. This one was a 14-in-1 (my ones at home are only 11-in-1 and 8-in-1 I believe) and this one was much cheaper than the ones I bought previously. Overall, quite happy with my purchase. The ports all work great and I tried plugging in as many devices as I could to see if I could overwhelm it but it continued to work as if there was only one device plugged in (no slow downs). What I especially like about this are the two USB-C ports vs. my other ones which only have one USB-C port which is constantly used by the power adapter so I technically lose it. The only con is that it is a bit heavy."
    },
    {
        "ReviewTitle": "plenty of connectivity options",
        "ReviewerName": "Farrukh Ijaz",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on May 31, 2020",
        "ReviewDesc": "I saw this with my colleague few months back and wanted to buy it. I have been looking for a USB-C converter that can offer LAN connectivity plus HDMI & VGA options. Unfortunately there is no single hub from Apple offering all options and you need two hubs in best case with combined cost of 200$, if not more. I am happy with this as a cost optimal solution where I can connect to both home monitor via HDMI and home lab server via LAN at the same time. VGA port is a plus as I dont have to worry about display connector type at customer offices."
    },
    {
        "ReviewTitle": "The ultimate USB C adapter that you can have",
        "ReviewerName": "Mechakoush",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on May 19, 2020",
        "ReviewDesc": "Packed with ports, a little bulky, well build and reliable, premium material and sturdy USB C cable.I love the build and size of the adapter, it is a little bulky but provides tons of ports with very nicely positioned, It does not have an Aux cable input which is a bummer for its size but not the biggest concern since I mostly use Bluetooth earbuds for music or sound.I use this with my iPad I connect mouse and keyboard with a Hard drive and ethernet port, sometimes I use the HDMI plug for movies and it never failed on me, yes sometimes the hard drive read would slow down if I use all the things together, but overall it manages very well without any major issues.I would recommend this to anyone who uses his iPad as his main device as it provides a lot of ports in a relatively small enclosure with a premium build quality.if you like this review please click the \"helpful\" button, Thank you :)"
    },
    {
        "ReviewTitle": "Absolutely every port you could want!",
        "ReviewerName": "J.T. Pickering",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on October 12, 2020",
        "ReviewDesc": "I love this adapter/dock! I hesitate to call it just an adapter because it can really replace most desktop docking stations since it has so many options. I recently started a new job and they provided me with a Macbook Pro. Of course these new Macbooks have no ports except for USB-C and I want to use my keyboard, mouse, large monitor, wired networking, flash drives, printer, USB audio interface, etc. when working at home. This adapter can keep all of that stuff connected and more!Additionally, I love that it has a power input! I have an extra Macbook charger that I leave plugged in at my desk. I can plug it into this adapter so that not only will the adapter output to all the devices I mentioned above, it will also charge/power the laptop! Truly a 1-cable solution that doesn't require an expensive Thunderbolt dock."
    },
    {
        "ReviewTitle": "Works with MacBook and iPad",
        "ReviewerName": "Murat P",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on February 23, 2020",
        "ReviewDesc": "I mainly got this for my MacBook. I got a new job where I do a lot of presentations, however the projectors at work only have VGA and not HDMI. I could have got an HDMI to VGA adapter, but for some reason they don't work well with USB-C dongles; so I decided to get another dongle. This one is particular for a couple of reasons.1) The build quality is very good. It's all metal, it's heavy and it doesn't seem like it'll break or anything. It would be better if the USB-C cable was detachable. It also comes with a carrying pouch.2) It has a lot of ports. It has USB 3.0 ports for data transfer and USB 2.0 ports for peripherals and charging. It also has a gigabit ethernet port as well as an HDMI and VGA. VGA Doesn't work with my iPad, but HDMI does. It can actually charge my iPad as well. The iPad can also recognize more than one external drive and project to an external screen using this dongle.3) It doesn't get warm. I've used it to charge 3-4 devices at the same time while using the VGA and Ethernet ports. My other dongles get significantly warmer than this one.Overall, I really recommend this. It's an all-in-one solution for all your USB-C devices, and as it connects through just one USB-C port, you can use it with a wide variety of devices."
    },
    {
        "ReviewTitle": "Lightweight and great design USB C Hub",
        "ReviewerName": "User 20",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 30, 2020",
        "ReviewDesc": "I am so happy about purchasing this USB-C hub. I use this device every day to connect my external monitor and drawing tablet for my online classes, and It is one of the life-changing tools for me. Moreover, I use it for charging my cell phone while I am in an online meeting during the pandemic. It is one little, durable, and sturdy dock with multiple useful ports such as SD/TF Card Reader, USB C, VGA, USB 2.0 Ports, and so. I am using it for a few hours every day and haven't had any overheating issues yet. Also, I like how the case looks; it is aluminum and very lightweight for what it does. As extra bonus, it comes with a carrying pouch to offer protection for this little toy."
    },
    {
        "ReviewTitle": "Exactly what I needed for my Computer",
        "ReviewerName": "Disisgaurav",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on July 23, 2020",
        "ReviewDesc": "Exactly what I needed for my X1 Carbon. I need more points for using various attachments and I often have to take one out to use another but no more. I'm really happy with this hub. Using it is a breeze, It's plug and play and the ports work as expected. This model cost a lot less (less than half) than some of the similar hubs in the market. It’s a must have “device” for any laptop user, infact this USB-C hub can be used for all types of computers as long as they have a USB-C port that include Mac computers and Windows computers. looks very sturdy and the performance haven’t affected due to multi devices attachment, highly recommend this powerhouse"
    }]
},
{
    "id": 3,
    "name": "Samsung Galaxy Buds Live",
    "title": "Samsung Galaxy Buds Live - Bronze, SM-R180NZNAXAC",
    "price": 208.00,
    "rating": 4,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/719Xfw823XL._AC_SX679_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Buds Live",
        "ReviewerName": "YeEn Kim",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 25, 2020",
        "ReviewDesc": "It's so beutiful and the quality is so good! The calling experience is way better than any other wireless earphones I had.The only improvement I want is the material. I mean the parts that I'm putting in my ears are hard... except that I 100% recommend!!!"
    },
    {
        "ReviewTitle": "No",
        "ReviewerName": "Dennis Ho",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Like it."
    }]
},
{
    "id": 4,
    "name": "AmazonBasics 5 Cup Coffee Maker",
    "title": "AmazonBasics 5 Cup Coffee Maker with Glass Carafe - Black",
    "price": 28.99,
    "rating": 4,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/81BwWF7hi%2BL._AC_SY879_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Warm Coffee",
        "ReviewerName": "Steff R",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on April 20, 2018",
        "ReviewDesc": "This would have been perfect. It is small and makes about two large size cups of coffees per pot. Just what I needed to replace the expensive Kcups. The problem is that the coffee comes out barely hot. I make the coffee then microwave it to get it to an acceptable temperature. I wouldn't recommend wasting your time buying this coffee maker."
    },
    {
        "ReviewTitle": "Poor Design - Over priced- Not recommend",
        "ReviewerName": "DH at YYC",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 11, 2018",
        "ReviewDesc": "This coffee maker suffers from poor design.  My main problem is the lip at the drain where the coffee flows to the pot.  This causes about 2  tablespoons of coffee to be trapped and thus the paper filter and grounds become a soggy mess and slobber all over my counter top.  Also, it doesn’t seem to heat the water as much as my previous makers, thus requiring more coffee grounds to be used.And the killer is this was more expensive than my previous Sunbeam and Black & Decker makers."
    },
    {
        "ReviewTitle": "Great Little Coffee Maker",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on April 4, 2019",
        "ReviewDesc": "I looked at the reviews on this coffee maker before purchasing and wow, they really are helpful! We're new to Amazon so really glad this machine was as good as others have said and is available at such a great price!  It's very easy to use, nice to have the water level on the front, and contrary to someone's review, the temperature is perfect once it's finished brewing! A full pot does only give two very large cups of coffee but that's perfect for the two of us :)  The reusable filter is great so no need to fiddle with those paper filters that won't come apart first thing in the morning! And it does make some noises at the end of the brewing but that was noted in the instruction sheet (and it does make a full pot in record time).  The only thing negative I could say is that the pot lid doesn't seem to come off so flops around when I'm cleaning it but not a big issue.  Would recommend this to anyone who needs a small coffee maker or lives with a tea drinker!"
    },
    {
        "ReviewTitle": "Be aware that this is TINY.",
        "ReviewerName": "Vees",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on April 21, 2020",
        "ReviewDesc": "I can't speak to how well it works because I never used it - as soon as I took it out of the box I knew it was too small for my needs. Looks great otherwise, if you live alone and would like two mugs of coffee out of a fully made pot, this thing would probably be perfect.Normally I use a french press, which is just enough for two medium-small mugs' worth for myself and my husband daily, but I wanted to jitter boldly into \"second cup of coffee\" territory without doubling my grounds usage. This coffeemaker's glass pot is NOT 5 cups as in 5 x 250ml, the total volume of the pot, if you filled it with water right to the brim, would be maybe 4 liquid 250ml cups, and if you follow the markings to the max \"5 cups\" maybe 3 250ml cups? So I don't know what the markings on the pot refer to, but it's not what I would call 5 cups of coffee.Anyway, I'm returning it unused because it's simply too small. I wish I hadn't wasted a month waiting for this darn thing and that I'd just ordered a 12-cup one at the outset. Live and learn!"
    },
    {
        "ReviewTitle": "Fast shipping. A little smaller than I had hoped. But works well",
        "ReviewerName": "Stwart",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on May 17, 2020",
        "ReviewDesc": "Writing this as I sip on my first Cup made from this little machine. My first thoughts are. Fast Shipping. Nicely packaged and undamaged. All pluses.5 cups is a bit of a stretch if you take into consideration the size of the coffee pictured. It makes just less than two cups of this particular cup. Simple to operate and set up as would be the standard. Having a basket strainer was one of the reasons I wanted this. It didn't affect operation of the machine or flavour but the basket bottom is oddly solid. I assume this makes it more sturdy. My only thought is the molding of the plastic bottom could be shaped differently to allow the water to drain out better as it has a small lip. Again it didn't seem to be an issue. Just a thought. All in all seems decent. I hope it lasts"
    },
    {
        "ReviewTitle": "Good!",
        "ReviewerName": "Felipe Selli",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on July 25, 2018",
        "ReviewDesc": "Pros:CompactHeat PlateEasy to use and cleanSort of Fast brewingCons:It doesnt shut of the heat plate auto, but that is not much of an hassle itself."
    },
    {
        "ReviewTitle": "Just a little better.",
        "ReviewerName": "Byron Wall",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 6, 2019",
        "ReviewDesc": "I have bought and used competing 5 cup coffee makers. Amazon’s is similar to the other brands, but just a little bit better. The carafe is designed ever so slightly differently with the result that Amazon’s is easier to pour from without spilling. And Amazon’s includes a reusable filter, making the paper filters unnecessary. Like other Amazon Basic products, it is a just a little better."
    },
    {
        "ReviewTitle": "Small profile is nice on a limited counter.",
        "ReviewerName": "Beau",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on July 31, 2019",
        "ReviewDesc": "For a cheapo coffee maker, its better than the crap you get at walmart. Good for someone who wants just two mugs of coffee at normal temperature. I like it because it is low profile, and doesnt take up loads of space on the counter."
    },
    {
        "ReviewTitle": "Simple, effective - exactly what it should be",
        "ReviewerName": "Sierra",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on October 29, 2020",
        "ReviewDesc": "This coffee percolator is exactly what it's stated - a basic coffee maker that does one thing and does it well, without any bells or whistles.I've been using the product each day for at least a week, and I'm very happy with it.The warmth of the plate could be warmer, but it's fine enough and doesn't burn.The machine is a bit smaller than what I had in mind, but that's actually a plus/positive (it takes up less space, it makes enough cups for two large travel mugs - perfect for one or two people, in my opinion, and it could \"make-do\" for three).I think one day I will upgrade to one with a clock and scheduler (for automatic start of the morning coffees - what's better than waking up to the smell of coffee?).Until then, this will do nicely.TLDR;Simple, effective, tasty coffee.Plate could be warmer, but it works fine as-is and doesn't burn the coffee.Use good beans and enjoy."
    },
    {
        "ReviewTitle": "Great little machine",
        "ReviewerName": "Val",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on December 1, 2019",
        "ReviewDesc": "Love this coffee maker.  Great sizeas i get 3 mugs of coffee from this pot and it doesn take up a lot of room on the counter. As i havent had very long i'm not sure about the ease of cleaning. Unfortunately it quit working after about 2 months of light use but Amazon replaced with a new one right away and it has been working great with no issues. Use daily. My only complaint is the included filter basket should have some kind of drainage on the bottom of basket, as the grounds stay very wet.Update to original post as ive only brewed about 10 to 12 pots of coffee with this maker and it will no longer brew. The power light comes on when turned on but nothing else happens. Completely disappointed and now amazon wont even speak with me about it."
    }]
},
{
    "id": 5,
    "name": "Fullmosa Compatible Apple Watch Band",
    "title": "Fullmosa Compatible Apple Watch Band 38mm 40mm 42mm 44mm for iWatch SE & Series 6 5 4 3 2 1",
    "price": 29.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71Xi2OUyD5L._AC_SX425_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Ok quality",
        "ReviewerName": "Marc-Antoine Claveau",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "Broke after one week"
    },
    {
        "ReviewTitle": ".",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "Bon produit"
    },
    {
        "ReviewTitle": "Nice",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 20, 2020",
        "ReviewDesc": "Nice color, not sure if it is genuine leather. Seems to be durable but maybe to early to tell has I just received it yesterday. For what the straps cost  can't complain."
    },
    {
        "ReviewTitle": "Good purchase",
        "ReviewerName": "Sara Moh",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Good quality leather, but a bit darker than expected as I have ordered the light brown one"
    },
    {
        "ReviewTitle": "Good quality",
        "ReviewerName": "therobmilne",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 18, 2020",
        "ReviewDesc": "Good quality. Better then I expected"
    },
    {
        "ReviewTitle": "Good for the price!",
        "ReviewerName": "Charles Durand",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 17, 2020",
        "ReviewDesc": "For the price, hard to beat!"
    },
    {
        "ReviewTitle": "excellent quality 5*",
        "ReviewerName": "Asif khan",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 16, 2020",
        "ReviewDesc": "excellent quality 5*"
    },
    {
        "ReviewTitle": "Looks amazing!",
        "ReviewerName": "Denyse R",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 16, 2020",
        "ReviewDesc": "I was really surprised by how great this looks and feels, for such a good price. Would recommend for sure !"
    },
    {
        "ReviewTitle": "Parfait pour une série 5",
        "ReviewerName": "Chaalal Ali idris",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 15, 2020",
        "ReviewDesc": "Bien !"
    },
    {
        "ReviewTitle": "Great product",
        "ReviewerName": "Charissa Cappis",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 10, 2020",
        "ReviewDesc": "Ordered this for my husband for Christmas to go with his apple watch.  Fits perfectly and is compatible with Apple Watch series 6.  Fast shipping.  Great product overall.  I haven't given it to him yet, but I know he'll love it."
    }]
},
{
    "id": 6,
    "name": "Smart speaker with Alexa",
    "title": "All-new Echo Dot (4th Gen) | Smart speaker with Alexa | Charcoal",
    "price": 39.99,
    "rating": 4,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71KJ6VCJlOL._AC_SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Clock Color",
        "ReviewerName": "John B",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 7, 2020",
        "ReviewDesc": "Nice product but we find the color of the clock itself is not conducive to night time sleeping. We wanted to replace it for our old clock radios (they have a red or blue led color), but no matter how low you dim the dot it still emits a color of light that wakes us up, especially if you look to see what time it is. I wonder if there will be a feature soon that will allow us to change the clock's led color?"
    },
    {
        "ReviewTitle": "Cannot get temperature outside",
        "ReviewerName": "Tal.B",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 12, 2020",
        "ReviewDesc": "So after over two calls to technical department ( 1@45 min other 1:00hr. ) and two different units I was still not able to get my Echo to tell me the temperature where I am in ( Cotre St Luc, Quebec ) . Tech department at all levels cannot understand and said just finaly \" you could always return it \" good marketing  . Not happy at all, I was on my way to convert my entire house into smart home with Amazon products."
    },
    {
        "ReviewTitle": "Speaker is good but terrible AI",
        "ReviewerName": "Trig",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on November 11, 2020",
        "ReviewDesc": "1 - After contacting their support line. I was told that the device was locked to certain flash news in Canada. Their choice is very limited and you won't have access to  some other foreign flash news channels.2- The AI would not shut after saying stop3- Don't ask to translate a word. Alexa is going to say I can translate this word in Spanish4- Alexa has a robot voice vs Google Home miniNow the pro:Itunes and Spotify are available for music.Good speaker and design"
    },
    {
        "ReviewTitle": "A decent speaker but AI needs some serious improvements",
        "ReviewerName": "Timeriver",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Update After Customer Service Call:The customer tech support team calls me very promptly after i leave the original review with technical concerns. They patiently collected my feedback and provide technical solutions for the questions i have.  Therefore, i update my rating to 4 stars thanks to the great customer service. The device works as expected after the initial churn of setting up.==========================Original Review================1. Alexa setup takes 30 mins. Despite having good IT skills myself, I cannot figure out why it cannot connect to my wifi. I have to directly add it on my router admin page with its mac address to make it work.2. The app has indeed TWO sets of serrings. One for the app itself which is useless and the real important setting for the dot is hidden. What a counter-intuitive UI??3. The AI itself is horrible. If i want it to voice out current time, it does not understand command like \"display current time\",\"show current time\". And there are countless such simple examples. Come on!I have high hopes for this device but apparently, it needs to be polished."
    }]
},
{
    "id": 7,
    "name": "Amazon Smart Plug",
    "title": "Amazon Smart Plug, works with Alexa",
    "price": 34.99,
    "rating": 5,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/51yy4dHf5VL._AC_SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "All the features Indeed!",
        "ReviewerName": "Jose  Artiga",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "All the features needed in this little  device , easy to set and to use"
    },
    {
        "ReviewTitle": "Disappointing audio with an excellent crisp picture",
        "ReviewerName": "britt",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "I'm not terribly impressed with this device thus far. To say the audio is disappointing is an understatement. The audio on my Echo Flex better. The quality is reminiscent of my parents muffled boom box from the early 90s. And it's certainly no help that the speaker is located on the BOTTOM of said device. I however am very impressed with the display. It's somehow almost as good as the picture quality on my 8th generation iPad.As my main intentions for this iPad were to listen to music, audiobooks, podcasts and YouTube videos at bedtime the poor audio is a real issue. This would have been a 5 star product otherwise."
    },
    {
        "ReviewTitle": "Straight trash",
        "ReviewerName": "Mark Iskander",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "The voice recognition is awful on these, and so is the overall software. Amazon CANNOT do software. They just don’t get it, or they haven’t hired the right people. There’s no reason why in 2020 it struggles performance-wise with the things it does. Here are some examples:- laggy slow software- asking Alexa to show a Nest camera? Yeah ask like three times before she actually does it. Otherwise she just goes “Okay!” and does nothing. I have 300mbit in this room so that ain’t it chief- asking Alexa to disarm Ring? Every few weeks she forgets that she’s allowed to do that and I have to go into the Alexa app (which is equally trash) to reconfigure that mess- asking Alexa to Arm home? 7/10 times she thinks I said “I’m home” and welcomes me instead. Awful microphones- got a Nest stream going? It will majorly mess up buffering 30 seconds in and go back to the home page- it won’t stop showing dumb suggestions on the Home Screen despite me turning all of that off- the speakers sound like trash so hopefully you weren’t planning on using it for music- did I mention the software quality of both the show and the Alexa app are both tragic?- Alexa as an assistant is dumb as hell and can’t maintain a pulse without installing some “skill” for itThis is the very first tech product that I ended up literally throwing in the garbage from how bad it is. Picture for evidence.If you were thinking about getting this or a Google Home, for the love of christ go with the Google Home, it’s just a different category entirely. Pay to play."
    },
    {
        "ReviewTitle": "Handy",
        "ReviewerName": "Dave",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "Find the Echo 5 very handy around the house."
    },
    {
        "ReviewTitle": "Same as every other Canadian review.... :-/",
        "ReviewerName": "Dave z.",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "The Echo Dots are handy, but this is pretty much a false advertised, useless piece of garbage with the added touch of a screen. The problems stem from Amazon not supporting their Canadian customers i the same manner as they do their US base. This device has so much potential, but the majority of any useful functions and features do not work in Canada. I suggest avoid Amazon products and go with a different company if this is not fixed in a timely manner. not much else to say, other than feature reviews got my excited, but I was quickly let down on setting everything up. ;-/"
    },
    {
        "ReviewTitle": "Don't buy",
        "ReviewerName": "Michael Denroche",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "Pretty useless. Only works half the time"
    }]
},
{
    "id": 8,
    "name": "Echo Plus (2nd gen)",
    "title": "Echo Plus (2nd gen) – Premium sound with built-in smart home - Sandstone",
    "price": 119.99,
    "rating": 1,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/61vPv8HtsRL._AC_SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Good robust unit for the price.",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 8, 2020",
        "ReviewDesc": "Wish it had a stand alone battery to use as a portable speaker.  Sound is room filling and clear.  Good range.  Not quite loud enough for my taste but nice.  Optional titles like calling it echo or computer brings out my inner geek.  If only it had Majel Jarret Roddenberry voice....."
    },
    {
        "ReviewTitle": "Good stuff",
        "ReviewerName": "Tie Conn",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 6, 2020",
        "ReviewDesc": "Makes automating things easier."
    }]
},
{
    "id": 9,
    "name": "Echo Show 8",
    "title": "Echo Show 8 – HD 8 inch smart display with Alexa",
    "price": 84.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/61pvbctlAGL._AC_SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "je l'adore!!!!",
        "ReviewerName": "valerie auger",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 25, 2020",
        "ReviewDesc": "je l'adore mon echo show 8"
    },
    {
        "ReviewTitle": "Frequently drops Bluetooth or refuses to connect",
        "ReviewerName": "Armand Tanzarian",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 24, 2020",
        "ReviewDesc": "Frequently drops Bluetooth or refuses to connect"
    },
    {
        "ReviewTitle": "very happy",
        "ReviewerName": "Westcoastguy",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "for $64cad , very happy to use it in our master-bedroom . the Google Hub Max is better for the livingroom and gazebo.  Echo only good for spare room , show tv 8 only good for maters bedroom. for better sound and better answers, the google products are much better"
    },
    {
        "ReviewTitle": "Cool",
        "ReviewerName": "Kiley",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "Can't wait to get my ring doorbell so I can glance over while upstairs and see what weirdo is lurking outside my house."
    },
    {
        "ReviewTitle": "Great little helper",
        "ReviewerName": "Maureen Dowdall",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "Love it makes chores easier no issues so far but still learning how to use."
    },
    {
        "ReviewTitle": "Needs netflix support and more mics",
        "ReviewerName": "pit bull",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "Only 2 microphones so you need to be loud.. also you cant watch netflix on it. Its ok if you can get it on sale.."
    },
    {
        "ReviewTitle": "Love it",
        "ReviewerName": "Kristen",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "We love our echo show! The screen size is perfect; not too small  and not too big. We listen to music on it daily!"
    },
    {
        "ReviewTitle": "Disappointed",
        "ReviewerName": "Svennen",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "My echo show worked ok for a couple of weeks but for over a month now we're struggling to get the speaker to do anything for us. It doesn't matter if it's for playing songs or answering questions, view YouTube or find a recipe, 9 times out of 10 it gives us a \"sorry, something went wrong. Please try later\". Netflix still isn't supported and when we ask for recipes for muffins we get recipies for smoothies... The video calling is really choppy and it's hard to make out anything that is being said. I have it paired with another echo to play music but it frequently drops the music in the second speaker.I'm really really hoping it's just Amazon's servers that are overwhelmed from the birthday sale and now black Friday sales but I'm starting to doubt anything will change.Rebooted this thing more times than I can remember but no change."
    },
    {
        "ReviewTitle": "Super bon appareil !",
        "ReviewerName": "Marc-Andre Brochu",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "J'ai acheté ce echo Show 8 pour ma cuisine a un très bon prix lors du Prime Day, je l'utilise pour écouter de la musique et diffuser des photos. L'appareil est facile a configurer et a utiliser. L'écran affiche très bien les photos et les vidéos. J'ai beaucoup l'intégration avec ma domotique et qu'un dimer apparait quand je commande mes lumières c'est très pratique. La fonction Drop In pour les conversation vidéo est super plaisante a utiliser !"
    },
    {
        "ReviewTitle": "Good picture",
        "ReviewerName": "Michelle",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 21, 2020",
        "ReviewDesc": "Love my Echo. Use it in the kitchen while I’m cooking."
    }]
},
{
    "id": 10,
    "name": "Ring Video Doorbell",
    "title": "Ring Video Doorbell – 1080p HD video, improved motion detection, easy installation – Venetian Bronze (2020 release)",
    "price": 39.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/611bAN%2B0zwL._SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "very disappointed",
        "ReviewerName": "D&D Home Art",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 25, 2020",
        "ReviewDesc": "App works every badly. Looks like nothing works(WiFi is good). Ring bell worked. I tried it from morning till now, not get better. I want watch direst video, not working either. I want make some setting up, not work...but it worked well yesterday... I don’t know what happed, maybe system sever got problem?"
    },
    {
        "ReviewTitle": "worked only for one day",
        "ReviewerName": "Reinhard Pinkal",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 25, 2020",
        "ReviewDesc": "This product worked only for one day. second day it showed \"streaming error\" tried many different changes in settings. no luck. if I cant get it to work Properly, i Have to return it. this is a hassle since I removed my old Doorbell.Very dissappointing"
    },
    {
        "ReviewTitle": "Great addition to home security",
        "ReviewerName": "Tracy",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 25, 2020",
        "ReviewDesc": "Very good quality and like that you can talk to people without answering the door."
    },
    {
        "ReviewTitle": "Great value.",
        "ReviewerName": "Kai Sing Wong",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 24, 2020",
        "ReviewDesc": "Great value. Easy to install."
    },
    {
        "ReviewTitle": "Great product",
        "ReviewerName": "Dave",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "Excellent purchase!!!"
    },
    {
        "ReviewTitle": "Awesome - as long as the outside temperature is above freezing",
        "ReviewerName": "Chris S. Oram",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "This video doorbell actually works as described.  I almost love it!Here is the trouble.... if you live in a place where the outside temperature is bellow zero degrees Celsius for period of time... like a Canadian winter, you can not expect the battery to hold a charge nor can you expect the attached doorbell wires to keep it charged.This is very disappointing... as winter lasts a few months around here with means weekly taking off the mount, disconnecting the doorbell wires and connecting it to a charger.  Not a big deal except for the fact that it is cold outside... at times too cold to be wanting to be fiddling with those doorbell screws on the back.This is enough to cause me to search out a replacement with an easily removable battery - with is a bummer as the Ring App and system is super fantastic. Would not purchase again."
    },
    {
        "ReviewTitle": "Battery function seriously degraded in cold weather",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 21, 2020",
        "ReviewDesc": "It would be awesome if I didn't live in Canada, as soon as it got cold, the battery stopped charging, I had to remove the hard wire connections, bring it inside and charge it. It say the the ring 2 should function down to -20 C, it stopped charging when we were well above that temp. The ring rep told me that I pretty much need to go with the ring pro because it doesn't have a battery."
    },
    {
        "ReviewTitle": "ring",
        "ReviewerName": "Alain Gauthier",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 21, 2020",
        "ReviewDesc": "merveilleux pour une personne qui n'entend pas bien comme moi, je reçois un message sur mon cell. Peut importe ou je suis."
    },
    {
        "ReviewTitle": "Does not charge the battery via hardwire.",
        "ReviewerName": "Mark Austin",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 20, 2020",
        "ReviewDesc": "I have tried 3 different transformers, all well within, and in fact above the power requirements stated by Ring, and yet they will not charge the battery. Poor software I believe. Lots of comments online...check it out first. Will only give it a few more weeks and if nothing gets resolved (while on the 3rd transformer!), I'll ditch this piece of junk and eat the loss I guess."
    },
    {
        "ReviewTitle": "Ok quality",
        "ReviewerName": "Ennis",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Great for the price"
    }]
},
{
    "id": 11,
    "name": "Ring Smart Lighting",
    "title": "Ring Smart Lighting – Floodlight, Wired, Outdoor Motion-Sensor Security Light, Black (Ring Bridge required)",
    "price": 49.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/51bFlydoduL._SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Works as described.",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on August 7, 2020",
        "ReviewDesc": "Works great."
    },
    {
        "ReviewTitle": "Get this light now",
        "ReviewerName": "Music ",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on July 31, 2020",
        "ReviewDesc": "Wow! Best lights better the beams work really fast. I don’t have strong internet but if you place the bridge close your wifi network works perfect. Great job ring"
    },
    {
        "ReviewTitle": "not worth buying",
        "ReviewerName": "Debbie McNair",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 26, 2019",
        "ReviewDesc": "garbage"
    },
    {
        "ReviewTitle": "Easy to install",
        "ReviewerName": "LBuckler",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 3, 2019",
        "ReviewDesc": "Easy to install and set up. Had to turn off the montion alert since there are too many birds in the back yard"
    },
    {
        "ReviewTitle": "Grouping Feature Etc...",
        "ReviewerName": "Cesar",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on October 27, 2019",
        "ReviewDesc": "Getting the grouping feature to work correctly is an absolute nightmare.  The lights can be individually turned on just fine through the App but having them all turn on all at once in their grouped network does not work.  They don't respond at all to motion from the floodlight cam that I have them grouped or vice versa which defeats the whole purpose.  I think there are tons of bugs with this and the software and they should have worked these out before releasing these to the public.  I will be returning and hoping that the next gen is much better quality controlled."
    }]
},
{
    "id": 12,
    "name": "Nespresso Pixie Coffee Machine by",
    "title": "Nespresso Pixie Coffee Machine by Breville - (BEC430TTN1BUC1), Titan",
    "price": 185.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/61NUqSDpwiL._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "5 étoile",
        "ReviewerName": "Client d'Amazon",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 3, 2020",
        "ReviewDesc": "Très bonne machine à café"
    },
    {
        "ReviewTitle": "Super",
        "ReviewerName": "Sylvie",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 24, 2020",
        "ReviewDesc": "Facile à utiliser"
    },
    {
        "ReviewTitle": "Expessio only",
        "ReviewerName": "Andrew Finch",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 4, 2020",
        "ReviewDesc": "Great value"
    },
    {
        "ReviewTitle": "Simple operation",
        "ReviewerName": "V.Bee",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 7, 2020",
        "ReviewDesc": "Quickly prepares your coffee, with simple operation.  Pay attention to manufactures suggestion to clean regularly. I clean my Nespresso Pixie once a week. I love it."
    },
    {
        "ReviewTitle": "Great coffeemaker without using too much counter space!",
        "ReviewerName": "Reichermeister",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on August 31, 2020",
        "ReviewDesc": "This is my second pixie. I had to put the other one to rest because the pump had gone eventually these things happen. I loved my first machine so much that I got one identical to the second one one difference though is that there is no more power button you just hit one of the buttons and that turns the machine on and in about nine minutes it will turn itself off with the on off safety feature it’s got built-in. This little machine may look small but it packs a powerful punch of 19 bars of pressure and makes excellent coffee. It is easy to clean and maintain.As you can see I really like this little machine and that’s why I opted for another one at quickly as I could."
    },
    {
        "ReviewTitle": "Makes excellent coffee.",
        "ReviewerName": "John M",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on August 30, 2020",
        "ReviewDesc": "Much better coffee maker than our previous and more expensive Nespresso machine. Compact and stylish. Has a lot of thin plastic parts so I hope that it will survive the test of time."
    },
    {
        "ReviewTitle": "It's coffee break all the time at my house!",
        "ReviewerName": "BKat98",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on August 12, 2020",
        "ReviewDesc": "My old model died after seven years of constant use so I was overjoyed to find that I was able to acquire the same machine! Yea! Love the wonderful coffee that it makes, especially lattes and espressos!"
    },
    {
        "ReviewTitle": "The Sweet Spot - Despite Cutbacks",
        "ReviewerName": "HK",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on August 10, 2020",
        "ReviewDesc": "This is my second Pixie, it's still the 'sweet spot' in the Original Line. Unless you need milk-based coffees, this is the one to buy. It's design and build quality are a cut above. 1-star off as the older model was 'illuminated' when turned on which facilitated operation and looked lovely. It also had an 'on-off' switch lacking in new model likely to cut costs. Finally, a handy carrying case is no longer available - ideal if taking to the office or cottage. Nespresso, please make this available again as it's a very useful accessory and made the Pixie even more portable, its nominal feature."
    }]
},
{
    "id": 13,
    "name": "Nespresso Variety Pack",
    "title": "Nespresso Variety Pack for OriginalLine, 50 Capsules",
    "price": 59.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71S41HVtXUL._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Great coffee & great client service",
        "ReviewerName": "Kayla",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 5, 2020",
        "ReviewDesc": "LOVE Nespresso coffee and this seller, Fine Coffee, was just perfect at fulfilling my order and the client service offered afterward when I had an issue was fantastic, simple, and easy. Would purchase again!"
    },
    {
        "ReviewTitle": "Good for the money",
        "ReviewerName": "Sheila",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 26, 2020",
        "ReviewDesc": "Good flavour and value for the money"
    },
    {
        "ReviewTitle": "Very satisfied",
        "ReviewerName": "Christian Levac",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 20, 2020",
        "ReviewDesc": "Very satisfied"
    },
    {
        "ReviewTitle": "Excellent café!",
        "ReviewerName": "Francine ",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 14, 2020",
        "ReviewDesc": "Mon bémol, c’est que le prix est meilleur si l’on fait directement l’achat chez Nespresso."
    },
    {
        "ReviewTitle": "Excellent taste and fast shipping",
        "ReviewerName": "Rolaverria",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 14, 2020",
        "ReviewDesc": "I received it in excellent conditions.The coffee are great. I recommend it. Also, I’m going to buy more in a few weeks."
    }]
},
{
    "id": 14,
    "name": "AmazonBasics Nespresso Coffee Pod Storage",
    "title": "AmazonBasics Nespresso Coffee Pod Storage Drawer Holder, 50 Capsule Capacity",
    "price": 23.99,
    "rating": 4,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/81wa%2B88fGWL._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "A good solution at a reasonable price.",
        "ReviewerName": "Joseph P",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 9, 2020",
        "ReviewDesc": "This is a handy storage unit for our pods.  It sits under our Keurig and hasn't shown any signs of difficulty dealing with the weight.  It's a bit larger than the Keurig footprint but we use the extra space for a small sugar dish.  I wish the drawers had slightly more capacity to hold all the different pods we like, but this is a better solution than the multiple containers we were using before.  After almost a year of using it we haven't had any trouble with it."
    },
    {
        "ReviewTitle": "Store the Kcup",
        "ReviewerName": "RAK",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 5, 2020",
        "ReviewDesc": "Perfect for kcup staged."
    },
    {
        "ReviewTitle": "It is OK",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 5, 2020",
        "ReviewDesc": "It is plastic and it is not as it appears"
    },
    {
        "ReviewTitle": "Nice!",
        "ReviewerName": "Sam Finlay",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 4, 2020",
        "ReviewDesc": "I really like this pod container! I actually ended up putting it on top of my microwave because it fit perfectly there. I have a mini keurig so it looked kind of awkward underneath it."
    },
    {
        "ReviewTitle": "Just Okay, better price at Walmart or Costco",
        "ReviewerName": "Shelby Hnatuk",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on October 26, 2020",
        "ReviewDesc": "It’s not bad but for the price I was expecting better quality. It’s cheap flimsy bendy aluminum and the one drawer doesn’t open fully. Not 100% satisfied but it will do the job. I rate it 5.3/10 stars."
    },
    {
        "ReviewTitle": "Très pratique",
        "ReviewerName": "Henriette Harvey",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 23, 2020",
        "ReviewDesc": "Belle apparence"
    },
    {
        "ReviewTitle": "Love it",
        "ReviewerName": "kian",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 22, 2020",
        "ReviewDesc": "I love this organizer for my cups and fits very well on my shelf really love it"
    }]
},
{
    "id": 15,
    "name": "Moscow Mule Copper Mugs",
    "title": "Moscow Mule Copper Mugs Gift Set - Set of 4",
    "price": 49.99,
    "rating": 5,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/819J26zHObL._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "delivery was quick",
        "ReviewerName": "Kindle Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 15, 2020",
        "ReviewDesc": "quick delivery, good price ."
    },
    {
        "ReviewTitle": "Nice Product",
        "ReviewerName": "Monica",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 11, 2020",
        "ReviewDesc": "Did some research before buying and these mugs had a great rating and did not disappoint."
    },
    {
        "ReviewTitle": "we love our Moscow Mules !",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 9, 2020",
        "ReviewDesc": "the presentation in these mugs is amazing ! keeps the moscow mules perfect cool temperature. use them all the time"
    },
    {
        "ReviewTitle": "Chemical discolouration",
        "ReviewerName": "Godden Garage",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on November 7, 2020",
        "ReviewDesc": "I was very excited to get this as an anniversary gift for my husband. Initially everything looked great. However the cups have a ring of discolouration on the. That will not clean or polish away. Also the copper straws are not well manufactured. There are very rough cut with burrs on the ends and very sharp edges. This was very disappointing as the reviews were favourable for this product and this manufacturer"
    },
    {
        "ReviewTitle": "Great mugs awful straws!",
        "ReviewerName": "Chris",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 31, 2020",
        "ReviewDesc": "Love love love the mugs! Straws unfortunately can not be used! Both ends have sharp loose bits of copper which potentially could come loose or cut a lip!!! Great product the straws need some work."
    }]
},
{
    "id": 16,
    "name": "Samsung Monitor T55 32 Inch",
    "title": "Samsung Monitor T55 32 Inch |32 inch Curved Monitor (LC32T550FDNXZA)",
    "price": 218.99,
    "rating": 2,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71j-LEOPs-L._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Satisfaite",
        "ReviewerName": "Rachelle Laplante",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 18, 2020",
        "ReviewDesc": "Satisfaite"
    },
    {
        "ReviewTitle": "Good",
        "ReviewerName": "Jacynthe",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 16, 2020",
        "ReviewDesc": "Good"
    },
    {
        "ReviewTitle": "Damaged peace or this is how it should be",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 4, 2020",
        "ReviewDesc": "After assemble everything screen is assembled crossed. Now I can adjust screen horizontal or make it straight. May I know how can we fix it or this is damaged peace ?"
    },
    {
        "ReviewTitle": "A decent working monitor.",
        "ReviewerName": "Stardust",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on October 27, 2020",
        "ReviewDesc": "I didn’t give this monitor a 4/5 star because 1st of all, shipping took along time for product to arrive. 2nd, the monitor is wobbly and doesn’t feel stable. When lowering the monitor, make sure you hold both corners of the screen and gently push down. Installation was simple enough but no written instruction, just pictures. I couldn’t find any videos for the installation either. Remember to keep the metal pin incase you ever need to transport the monitor. It keeps the stand from accidentally popping up as you are carrying the monitor. I’ve only just installed the monitor so can’t really comment on the graphic or use yet.  However, it turned on and works fine. The price is reasonable for a monitor that swivels, tilt, and has height adjustment. Planing on using it for my kid’s schooling so it will do. I will change the rating after a month or so of using this monitor if nothing goes wrong."
    },
    {
        "ReviewTitle": "Decent for price.",
        "ReviewerName": "Tini",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 22, 2020",
        "ReviewDesc": "Ordered it the day before and got it as soon as the next day arrived. The screen and brightness is decent, don't expect a high quality gaming monitor. It works well enough for work use. Been using it as a second monitor. The cable is a hdmi, so if your pc only has one hdmi and three dslr plugs, you might want to invest in a Dslr to hdmi cable from your nearest/trusted electronic store.overall worth the money, the screen height is adjustable and can be tilted. I don't have any regrets with this purchase."
    }]
},
{
    "id": 17,
    "name": "Rankie DisplayPort to DisplayPort Cable",
    "title": "Rankie DisplayPort to DisplayPort Cable, DP to DP, 4K Resolution, 6 Feet, Black",
    "price": 11.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/61JISsq3KqL._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Good Quality",
        "ReviewerName": "Max B",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 13, 2020",
        "ReviewDesc": "Thick cables, works as described. Good value"
    },
    {
        "ReviewTitle": "Nice Cable",
        "ReviewerName": "Bo'sun",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on March 25, 2020",
        "ReviewDesc": "Good cable. Works as advertised. Has locking connectors which is nice. The insulation appears to be thick. I like this brand of cable better than the Amazon Basics DP cables."
    },
    {
        "ReviewTitle": "Wrong item shipped",
        "ReviewerName": "Johna",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on March 12, 2020",
        "ReviewDesc": "Already have 6ft, 4K capable cable between my dock and monitor. The un-needed cable length creates a \"rat nest\" behind my MacBook Pro. I needed 18-24\" cable to be perfect but seems this length is unavailable. Purchased the CableCreation 3ft cable. Out of the shipping bag the cable seemed too long. Quick measurement on average diameter of cable coils in the bag, therefore circumference/length of coil, multiplied by number of cable coils gave 70\" length, approximately. So they shipped a 6ft cable in a bag labelled as 3ft. Very, very poor."
    },
    {
        "ReviewTitle": "Works at 4k 60 Hz",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on January 30, 2020",
        "ReviewDesc": "Got the 16.5 foot cable and it perfectly delivers 4k 60 Hz to my LG monitor. Decently thick cable,."
    },
    {
        "ReviewTitle": "Yes",
        "ReviewerName": "BaggaFX",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 2, 2019",
        "ReviewDesc": "It just works"
    },
    {
        "ReviewTitle": "Defective",
        "ReviewerName": "Mike Mattless",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on October 3, 2019",
        "ReviewDesc": "Only one of my two cables work. One of the pins doesn't go down when pressing the button. The one cable works on both monitors, but the other doesn't work on any."
    }]
},
{
    "id": 18,
    "name": "Seneo Wireless Charger",
    "title": "Seneo Wireless Charger, 3 in 1 Wireless Charging Station ",
    "price": 49.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/71bjdpbTYSL._AC_SL1280_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Easy to use and easy to set up.",
        "ReviewerName": "Ryan David",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 23, 2020",
        "ReviewDesc": "A pretty solid and affordable charging station.Worth the price and extremely easy to set up.Once I purchase a smaller Apple watch charger, it’ll be a lot better. I advise this to anyone who purchases it, as it’s easier to store the wiring!Ontop of that I also received it on the standard free shipping option and it arrived within 48 hours!"
    },
    {
        "ReviewTitle": "Great product",
        "ReviewerName": "Alyx Maga",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "Great quality, easy to set up, super impressed!"
    },
    {
        "ReviewTitle": "Thick case friendly",
        "ReviewerName": "Aprile",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "Works with thick cases"
    },
    {
        "ReviewTitle": "Well made. I have just started using it",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 22, 2020",
        "ReviewDesc": "They should have provided Q2.5-3Q power adapterMaybe charge little extra as I have apple adapter.That makes life easier rather go to look for the Q. adapters"
    },
    {
        "ReviewTitle": "Worth the purchase!",
        "ReviewerName": "Denzel",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Really convenient! No more wires everywhere! Also the included wire for the airpods were a great addition👍🏽👍🏽"
    },
    {
        "ReviewTitle": "Won’t charge iPhone 12 pro max",
        "ReviewerName": "Luke A.",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Doesn’t seem to charge my iPhone 12 pro max. The led light will flash blue and green"
    },
    {
        "ReviewTitle": "Convenient Thing to charge all three apple devices",
        "ReviewerName": "Ruth Scothorn",
        "ReviewerRating": 4,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "I bought three of these for my kids and they loved them.  I did have to buy three additional fast chargers in order for the fast charging capability to work.  Very convenient to be able to change the iphone, apple watch and airpods all at once.We did have a few issues with the cord that fits into the back of the unit.  The end of the cord is not a common one and it bends very easily and can easily break if you are not careful.  I am now trying to find a replacement cord.  It would be much easier if they used a common charging cord.Overall, it is definitely worth the money."
    },
    {
        "ReviewTitle": "Wouldn’t recommend",
        "ReviewerName": "Shawn",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 19, 2020",
        "ReviewDesc": "Did not come with all parts, takes forever to charge and rarely charges my Apple Watch properly"
    },
    {
        "ReviewTitle": "Le chargeur EarPods/watch ne charge plus après moins de 2 mois d’usage.",
        "ReviewerName": "Client d'Amazon",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 18, 2020",
        "ReviewDesc": "Extrêmement déçue de la qualité de ce produit. Acheté en septembre 2020 et nous voici en novembre 2020 et le chargeur pour EarPods/Apple Watch ne charge plus. Considérant que la station de charge a été offerte en cadeau, c’est non seulement décevant mais aussi gênant. Je ne recommande pas ce produit."
    },
    {
        "ReviewTitle": "Wireless charger good for mobile and EarPods",
        "ReviewerName": "Mijo",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on November 17, 2020",
        "ReviewDesc": "Apple Watch series 6 charger is not suitable."
    }]
},
{
    "id": 19,
    "name": "Timex Men's Sport Watch",
    "title": "Timex Men's Sport Expedition Ranger Solar 43mm Leather Strap Watch",
    "price": 64.99,
    "rating": 3,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/717JORzTWdL._AC_SL1000_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Watch",
        "ReviewerName": "Dianne",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on December 25, 2019",
        "ReviewDesc": "Loved it!!"
    },
    {
        "ReviewTitle": "I went wrong o",
        "ReviewerName": "lee simpson",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on December 18, 2019",
        "ReviewDesc": "Sadly this watch ended up being sub par, looked great and it went with a lot of my outfits easily, the solar however let me down, died about two weeks ago, I’ve tried twice to recharge in direct sunlight for hours but nothing,,,,,,can’t return direct to times either .....bummed out"
    },
    {
        "ReviewTitle": "All good. Second and is not aligned with miute markers. Worth money",
        "ReviewerName": "Vladimir & Anna",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 12, 2019",
        "ReviewDesc": "Watch looks stylish, blue face, metal case and brown geniune leather band, a little bit of orange. Came dead, exposed it to light for 2 hours and now its completely fine. Put a gorilla glass on it, had spare from previous watch. The lumination of hands going away very fast, but you can still see it in a completely dark room. Dont know how the battery would behave, but hopefully would never need to replace batteries again. Date and time is easily set. The only thing that pisses me off is that second hand is not aligned with the minute markers. So it cannot be precise on 12 hour mark, it shows 0.5 seconds. However it's not someting that is important. Overall it's a great watch, Personally im finally settled with these ones. Recommend to buy."
    },
    {
        "ReviewTitle": "Amazing watch",
        "ReviewerName": "Hassan",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 24, 2019",
        "ReviewDesc": "Great value!"
    },
    {
        "ReviewTitle": "My new favorite watch",
        "ReviewerName": "Ron",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 19, 2019",
        "ReviewDesc": "I wanted t get a watch with a brown leather band and was surprised to find this one on the lists.  I have fallen in love with it. In the bright summer sunshine, my watch hand is hanging out the car window to catch the energizing rays to recharge the batteries. It is an easy to read watch and the smaller orange numbers compliment the watch's style. I enjoy wearing it and find it very practical. Really do wish it had an Indiglo feature (..but that would probably drain the batteries power reserve.) I like this watch."
    },
    {
        "ReviewTitle": "Better than expected",
        "ReviewerName": "Ron Melnyk",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 6, 2019",
        "ReviewDesc": "It's harder and harder to find a store that still sells and installs watch batteries so I thought a solar watch was the way to go.I had a Timex self wind when I was a kid and loved it and this solar is no different.  Hard to beat the price and it makes me want to go outside more on sunny days even though it charges with ordinary light.. Has not lost a second in the two weeks I have had it. Jus wish the second hand was as white or luminous as should the hour and min hands.  Hands only stay luminous for a short while only. I did not realize this and find this strange but Its water resistant and no problem in the shower. Great watch for the price......and was delivered within 4 days without Prime."
    },
    {
        "ReviewTitle": "watch",
        "ReviewerName": "terence hodgkins",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on May 20, 2019",
        "ReviewDesc": "everything you could ask for. good watch"
    }]
},
{
    "id": 20,
    "name": "Wireless Charger",
    "title": "Wireless Charger,4 in 1 Wireless Charging Station ",
    "price": 54.99,
    "rating": 2,
    "totalReviews": 10,
    "image": "https://images-na.ssl-images-amazon.com/images/I/61A2VCeFHRL._AC_SL1500_.jpg",
    "About": [
    {
        "itemDesc": "Unlocked cell phones are compatible with GSM carrier such as AT&T and T-Mobile, but are not compatible with CDMA carriers such as Verizon and Sprint"
    },
    {
        "itemDesc": "Please check if your GSM cellular carrier supports the bands for this model before purchasing, LTE may not be available in all areas"
    },
    {
        "itemDesc": "This device may not include a US warranty as some manufacturers do not honor warranties for international items"
    },
    {
        "itemDesc": "Device may come with foreign charger however seller will provide a US travel socket separately"
    }],
    "Reviews": [
    {
        "ReviewTitle": "Doesn’t work",
        "ReviewerName": "Chris",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on November 3, 2020",
        "ReviewDesc": "It will stop charging about 5 minutes after you put your devices on it. The LED flashes letting you know that the devices are not connected properly but they are. The LED is also super bright so don’t use it in a bedroom. Flashing blue and red led keeps waking me up. I have gone back to plugging in my phone."
    },
    {
        "ReviewTitle": "Annoying",
        "ReviewerName": "Ogopogie",
        "ReviewerRating": 3,
        "postedDate": "Reviewed in Canada on October 29, 2020",
        "ReviewDesc": "Led light on front is really bright and annoying for bedside. The magnetic attachment for watch isn’t the strongest. Could have been better designed but does work fairly well with the right power supply."
    },
    {
        "ReviewTitle": "Doesn’t charge",
        "ReviewerName": "Shammi Akhtar",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on October 20, 2020",
        "ReviewDesc": "Doesn’t charge the phone , I watch and EarPods together we have to charge them separately , if we put together one or two of them doesn’t charge"
    },
    {
        "ReviewTitle": "didnt work properly",
        "ReviewerName": "Avital Moalem",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on October 18, 2020",
        "ReviewDesc": "A beautiful piece but it doesnt work. I got mine and i set my apple watch to charge over night and didnt even charge it half way. I am returning it and want a refund right away. Pretty disappointed because i thought it looked really nice."
    },
    {
        "ReviewTitle": "Highly Recommend This Product !",
        "ReviewerName": "asilia thevarajah",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on October 16, 2020",
        "ReviewDesc": "No more hassle!I can finally watch my shows and charge it at the same time while I get ready for work ! Worth it for the price."
    },
    {
        "ReviewTitle": "Waste of money",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 2,
        "postedDate": "Reviewed in Canada on October 4, 2020",
        "ReviewDesc": "Took forever to charge your phone"
    },
    {
        "ReviewTitle": "Watch charger doesn’t work",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 1,
        "postedDate": "Reviewed in Canada on September 28, 2020",
        "ReviewDesc": "The watch charger stopped working 1 month after I bought it. Wouldn’t recommend"
    },
    {
        "ReviewTitle": "Très bel achat !",
        "ReviewerName": "Amazon Customer",
        "ReviewerRating": 5,
        "postedDate": "Reviewed in Canada on September 25, 2020",
        "ReviewDesc": "Un très bel achat fonctionne super bien ! Seule chose qui me fatigue c’est la lumière bleu quand ça charge, d’où le post it bleu haha car il est dans ma chambre mais absolument rien a dire pour le reste!"
    }]
}]